n5/src/BusinessProcesses/TimesheetApproval/TimesheetApproval.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>TimesheetApproval</name>
  <task>Task.Task</task>
  <attributes>
    <name>Project</name>
    <type>
      <types>CatalogRef.Projects</types>
    </type>
  </attributes>
  <attributes>
    <name>Timesheet</name>
    <type>
      <types>DocumentRef.Timesheet</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

n5/src/InformationRegisters/TimeResolutions/TimeResolutions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TimeResolutions</name>
  <resources>
    <name>Resolution</name>
    <type>
      <types>EnumRef.Resolutions</types>
    </type>
  </resources>
  <resources>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <dimensions>
    <name>TimesheetApproval</name>
    <type>
      <types>BusinessProcessRef.TimesheetApproval</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/Catalogs/Projects/Projects.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Projects</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Organizations</owners>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Appearance</name>
    <type>
      <types>CatalogRef.CalendarAppearance</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Completed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompletionDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Cost</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Data</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateStart</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DocumentRef.IncomingEmail</types>
      <types>DocumentRef.OutgoingEmail</types>
    </type>
  </attributes>
  <attributes>
    <name>Folder</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HourlyRate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Manager</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Minutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ObligatoryTasks</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PaidMinutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Pricing</name>
    <type>
      <types>EnumRef.ProjectsPricing</types>
    </type>
  </attributes>
  <attributes>
    <name>ProjectType</name>
    <type>
      <types>EnumRef.ProjectTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>UseApprovingProcess</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ApprovalList</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>Priority</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Tasks</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>HourlyCost</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>HourlyRate</name>
      <type>
        <types>DefinedType.Rate</types>
      </type>
    </attributes>
    <attributes>
      <name>Minutes</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Task</name>
      <type>
        <types>CatalogRef.Tasks</types>
      </type>
    </attributes>
    <attributes>
      <name>TimeType</name>
      <type>
        <types>EnumRef.Time</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/BusinessProcesses/TimesheetApproval/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var PassedRoutePoint;
var PreviousExecutor;
var NextApprovalUser;

Procedure ApprovalBeforeCreateTasks ( BusinessProcessRoutePoint, TasksBeingFormed, StandardProcessing )
	
	StandardProcessing = false;
	createApprovalTasks ( TasksBeingFormed );
	
EndProcedure

Procedure createApprovalTasks ( TasksBeingFormed )
	
	usersArray = getApprovalUsers ();
	for each user in usersArray do
		task = Tasks.Task.CreateTask ();
		task.BusinessProcess = Ref;
		task.Date = CurrentSessionDate ();
		task.RoutePoint = BusinessProcesses.TimesheetApproval.RoutePoints.Approval;
		task.User = user;
		task.Description = "" + task.RoutePoint;
		task.Write ();
		TasksBeingFormed.Add ( task );
	enddo; 
	
EndProcedure 

Function getApprovalUsers ()
	
	usersArray = new Array ();
	if ( PassedRoutePoint = BusinessProcesses.TimesheetApproval.RoutePoints.IsExistsNext ) then
		usersArray.Add ( NextApprovalUser );
		return usersArray;
	endif;
	q = new Query ();
	if ( PassedRoutePoint = BusinessProcesses.TimesheetApproval.RoutePoints.Rework ) then
		s = "
		|select TimeResolutions.User as User
		|from InformationRegister.TimeResolutions as TimeResolutions
		|where TimesheetApproval = &TimesheetApproval
		|";
		q.SetParameter ( "TimesheetApproval", Ref );
	else
		s = "
		|select min ( Priority ) as Priority
		|into MinimalPriority
		|from Catalog.Projects.ApprovalList as ApprovalList
		|where ApprovalList.Ref = &Project
		|;
		|select ApprovalList.User as User
		|from Catalog.Projects.ApprovalList as ApprovalList
		|	join MinimalPriority as MinimalPriority
		|	on MinimalPriority.Priority = ApprovalList.Priority
		|where ApprovalList.Ref = &Project
		|";
		q.SetParameter ( "Project", Project );
	endif;
	q.Text = s;
	usersArray = q.Execute ().Unload ().UnloadColumn ( "User" );
	return usersArray;
	
EndFunction 

Procedure ApprovalBeforeExecute ( BusinessProcessRoutePoint, Task, Cancel )
	
	markParallelTaskAsExecuted ( BusinessProcessRoutePoint );
	
EndProcedure

Procedure markParallelTaskAsExecuted ( RoutePoint )
	
	table = getParallelTasks ( RoutePoint );
	for each row in table do
		obj = row.Task.GetObject ();
		obj.Executed = true;
		obj.Write ();
	enddo; 
	
EndProcedure 

Function getParallelTasks ( RoutePoint )
	
	s = "
	|select Tasks.Ref as Task
	|from Task.Task as Tasks
	|where Tasks.RoutePoint = &RoutePoint
	|and Tasks.BusinessProcess = &BP
	|and Tasks.User <> &Executor
	|";
	q = new Query ( s );
	q.SetParameter ( "BP", Ref );
	q.SetParameter ( "RoutePoint", RoutePoint );
	q.SetParameter ( "Executor", SessionParameters.User );
	return q.Execute ().Unload ();
	
EndFunction

Procedure ApprovalOnExecute ( BusinessProcessRoutePoint, Task, Cancel )
	
	PreviousExecutor = DF.Pick ( Task, "User" );
	
EndProcedure

Procedure SwitchByResolutionSwitchProcessing ( SwitchPoint, Result )
	
	resolution = getResolution ();
	if ( resolution = Enums.Resolutions.Approve ) then
		//@skip-warning
		Result = SwitchPoint.Cases.Approve;
	elsif ( resolution = Enums.Resolutions.Rework ) then
		//@skip-warning
		Result = SwitchPoint.Cases.Rework;
	else
		//@skip-warning
		Result = SwitchPoint.Cases.Reject;
	endif; 
	
EndProcedure

Function getResolution ()
	
	p = new Structure ( "TimesheetApproval", Ref );
	return InformationRegisters.TimeResolutions.Get ( p ).Resolution;
	
EndFunction 

Procedure ReworkOnCreateTask ( BusinessProcessRoutePoint, TasksBeingFormed, Cancel )
	
	setExecutorByTimesheet ( TasksBeingFormed );
	
EndProcedure

Procedure setExecutorByTimesheet ( Tasks )
	
	for each task in Tasks do
		task.User = DF.Pick ( task.BusinessProcess, "Timesheet.Creator" );
	enddo; 
	
EndProcedure 

Procedure IsExistsNextConditionCheck ( BusinessProcessRoutePoint, Result )
	
	getNextApprovalUser ();
	PassedRoutePoint = BusinessProcessRoutePoint;
	Result = NextApprovalUser <> undefined;
	
EndProcedure

Procedure getNextApprovalUser ()
	
	s = "
	|select top 1 ApprovalList.Priority as Priority
	|into CurrentPriority
	|from Catalog.Projects.ApprovalList as ApprovalList
	|where ApprovalList.Ref = &Project
	|and ApprovalList.User = &PreviousExecutor
	|;
	|select top 1 ApprovalList.User as User
	|from Catalog.Projects.ApprovalList as ApprovalList
	|	join CurrentPriority as CurrentPriority
	|	on CurrentPriority.Priority < ApprovalList.Priority
	|where ApprovalList.Ref = &Project
	|order by ApprovalList.Priority
	|";
	q = new Query ( s );
	q.SetParameter ( "Project", Project );
	q.SetParameter ( "PreviousExecutor", PreviousExecutor );
	table = q.Execute ().Unload ();
	NextApprovalUser = ? ( table.Count () = 0, undefined, table [ 0 ].User );
	
EndProcedure 

Procedure ReworkOnExecute ( BusinessProcessRoutePoint, Task, Cancel )
	
	PassedRoutePoint = BusinessProcessRoutePoint;
	
EndProcedure

#endif
